Transformacion de los archivos

In [1]:
# importar librerias
import pandas as pd
from datetime import datetime as dt
import numpy as np

In [2]:
# Cargar de los DataSets en DataFrame
df_1 = pd.read_csv("ratings/1.csv") 
df_2 = pd.read_csv("ratings/2.csv") 
df_3 = pd.read_csv("ratings/3.csv") 
df_4 = pd.read_csv("ratings/4.csv") 
df_5 = pd.read_csv("ratings/5.csv") 
df_6 = pd.read_csv("ratings/6.csv")
df_7 = pd.read_csv("ratings/7.csv") 
df_8 = pd.read_csv("ratings/8.csv")

Renombrar la columna rating por score en cada tabla

In [3]:
df_1 = df_1.rename(columns={'rating':'score'})
df_2 = df_2.rename(columns={'rating':'score'})
df_3 = df_3.rename(columns={'rating':'score'})
df_4 = df_4.rename(columns={'rating':'score'})
df_5 = df_5.rename(columns={'rating':'score'})
df_6 = df_6.rename(columns={'rating':'score'})
df_7 = df_7.rename(columns={'rating':'score'})
df_8 = df_8.rename(columns={'rating':'score'})

In [4]:
# Verifico el tipo de dato del campo timestamp
print((df_1['timestamp'].dtypes))

int64

Cambio de el tipo de dato a fecha de la columna timestamp

In [5]:
# Cambiar el formato del campo "timestamp" a StrfTime
df_1['timestamp'] = pd.to_datetime(df_1['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_2['timestamp'] = pd.to_datetime(df_2['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_3['timestamp'] = pd.to_datetime(df_3['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_4['timestamp'] = pd.to_datetime(df_4['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_5['timestamp'] = pd.to_datetime(df_5['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_6['timestamp'] = pd.to_datetime(df_6['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_7['timestamp'] = pd.to_datetime(df_7['timestamp'], unit='s').dt.strftime('%Y-%m-%d')
df_8['timestamp'] = pd.to_datetime(df_8['timestamp'], unit='s').dt.strftime('%Y-%m-%d')

In [6]:
print(df_1['timestamp'].dtypes)

object

In [7]:
# Cambio de formato del campo timestamp a DateTime
df_1['timestamp'] = pd.to_datetime(df_1['timestamp'])
df_2['timestamp'] = pd.to_datetime(df_2['timestamp'])
df_3['timestamp'] = pd.to_datetime(df_3['timestamp'])
df_4['timestamp'] = pd.to_datetime(df_4['timestamp'])
df_5['timestamp'] = pd.to_datetime(df_5['timestamp'])
df_6['timestamp'] = pd.to_datetime(df_6['timestamp'])
df_7['timestamp'] = pd.to_datetime(df_7['timestamp'])
df_8['timestamp'] = pd.to_datetime(df_8['timestamp'])

In [8]:
# Verifico el cambio de tipo de dato
print(df_1['timestamp'].dtypes)
print(df_2['timestamp'].dtypes)
print(df_3['timestamp'].dtypes)
print(df_4['timestamp'].dtypes)
print(df_5['timestamp'].dtypes)
print(df_6['timestamp'].dtypes)
print(df_7['timestamp'].dtypes)
print(df_8['timestamp'].dtypes)

datetime64[ns]
datetime64[ns]
datetime64[ns]
datetime64[ns]
datetime64[ns]
datetime64[ns]
datetime64[ns]
datetime64[ns]

In [9]:
df_1

         userId  score  timestamp movieId
0             1    1.0 2015-03-09   as680
1             1    4.5 2015-03-09  ns2186
2             1    5.0 2015-03-09  hs2381
3             1    5.0 2015-03-09  ns3663
4             1    5.0 2015-03-09  as9500
...         ...    ...        ...     ...
1499995   15424    4.0 2013-06-02  as8698
1499996   15424    3.5 2013-05-26  as3663
1499997   15424    3.0 2013-06-29  as1325
1499998   15424    3.5 2013-06-29  ns4446
1499999   15424    3.5 2013-05-26  hs2569

[1500000 rows x 4 columns]

In [10]:
df_2['timestamp']

0         2013-05-26
1         2013-05-26
2         2013-05-26
3         2013-06-29
4         2013-05-26
             ...
1499995   1997-06-30
1499996   1997-06-30
1499997   1997-06-30
1499998   2000-11-14
1499999   2000-11-14
Name: timestamp, Length: 1500000, dtype: datetime64[ns]

In [11]:
df_3['timestamp']

0         2000-11-14
1         2000-11-14
2         2000-11-14
3         2000-11-14
4         2000-11-14
             ...
1499995   2001-07-06
1499996   2001-07-27
1499997   2001-07-06
1499998   2001-07-27
1499999   2001-10-30
Name: timestamp, Length: 1500000, dtype: datetime64[ns]

In [12]:
df_4['timestamp']

0         2002-03-08
1         2002-01-29
2         2001-07-27
3         2001-07-27
4         2001-07-27
             ...
1499995   2015-07-28
1499996   2015-07-28
1499997   2015-06-30
1499998   2015-07-28
1499999   2015-07-28
Name: timestamp, Length: 1500000, dtype: datetime64[ns]

In [13]:
df_5['timestamp']

0         2015-07-28
1         2015-06-30
2         2015-07-28
3         2015-07-28
4         2015-07-28
             ...
1499995   1997-01-07
1499996   1997-01-07
1499997   1997-01-07
1499998   1997-01-07
1499999   1997-01-07
Name: timestamp, Length: 1500000, dtype: datetime64[ns]

In [14]:
df_6['timestamp']

0         2016-04-13
1         2016-04-28
2         2016-04-09
3         2016-04-09
4         2016-04-09
             ...
1499995   1998-04-01
1499996   1998-04-01
1499997   1998-04-01
1499998   1998-04-01
1499999   1998-04-01
Name: timestamp, Length: 1500000, dtype: datetime64[ns]

In [15]:
df_7['timestamp']

0        1998-04-01
1        1998-04-01
2        1998-04-01
3        1998-04-01
4        1998-04-01
            ...
524284   2009-10-31
524285   2009-10-31
524286   2009-10-31
524287   2009-11-01
524288   2009-10-31
Name: timestamp, Length: 524289, dtype: datetime64[ns]

In [16]:
df_8['timestamp']

0         2012-10-19
1         2012-10-15
2         2012-10-19
3         2012-10-15
4         2012-10-19
             ...
1499995   2007-12-04
1499996   2007-12-04
1499997   2007-12-04
1499998   2007-12-04
1499999   2007-12-04
Name: timestamp, Length: 1500000, dtype: datetime64[ns]

$
ConcatenarData
$

In [17]:
df_ratings_completo = pd.concat([df_1, df_2, df_3, df_4, df_5, df_6, df_7, df_8])

In [18]:
df_ratings_completo

         userId  score  timestamp movieId
0             1    1.0 2015-03-09   as680
1             1    4.5 2015-03-09  ns2186
2             1    5.0 2015-03-09  hs2381
3             1    5.0 2015-03-09  ns3663
4             1    5.0 2015-03-09  as9500
...         ...    ...        ...     ...
1499995  124380    4.5 2007-12-04  ns5272
1499996  124380    2.5 2007-12-04  ns5492
1499997  124380    3.5 2007-12-04   hs305
1499998  124380    4.5 2007-12-04  ns7881
1499999  124380    1.5 2007-12-04   as883

[11024289 rows x 4 columns]

In [19]:
# Exportar a csv
df_ratings_completo.to_csv("ratings/ratings_completo.csv", index=False)

In [20]:
df_ratings_completo = pd.read_csv("ratings/ratings_completo.csv")

In [21]:
df_ratings_completo.head()

   userId  score   timestamp movieId
0       1    1.0  2015-03-09   as680
1       1    4.5  2015-03-09  ns2186
2       1    5.0  2015-03-09  hs2381
3       1    5.0  2015-03-09  ns3663
4       1    5.0  2015-03-09  as9500

In [22]:
df_ratings_completo.info

<bound method DataFrame.info of           userId  score   timestamp movieId
0              1    1.0  2015-03-09   as680
1              1    4.5  2015-03-09  ns2186
2              1    5.0  2015-03-09  hs2381
3              1    5.0  2015-03-09  ns3663
4              1    5.0  2015-03-09  as9500
...          ...    ...         ...     ...
11024284  124380    4.5  2007-12-04  ns5272
11024285  124380    2.5  2007-12-04  ns5492
11024286  124380    3.5  2007-12-04   hs305
11024287  124380    4.5  2007-12-04  ns7881
11024288  124380    1.5  2007-12-04   as883

[11024289 rows x 4 columns]>

In [23]:
df_ratings_completo.describe()

             userId         score
count  1.102429e+07  1.102429e+07
mean   8.997251e+04  3.533455e+00
std    8.686601e+04  1.059692e+00
min    1.000000e+00  5.000000e-01
25%    2.855800e+04  3.000000e+00
50%    5.684300e+04  3.500000e+00
75%    1.168670e+05  4.000000e+00
max    2.708960e+05  5.000000e+00